usr/src/usr.sbin/ifconfigd/ifconfigd.8
.\"
.\" Copyright (c) 2011 Rafael Sadowski <rafael@sizeofvoid.org> 
.\" Copyright (c) 2004, 2005, 2007 Esben Norby <norby@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 24 2010 $
.Dt IFCONFIGD 8
.Os
.Sh NAME
.Nm ifconfigd
.Nd "Network Interface Daemon"
.Sh SYNOPSIS
.Nm
.Op Fl dnv
.Op Fl f Ar file
.Op Fl s Ar socket
.Sh DESCRIPTION
.Nm
is an OpenBSD Network Interface Daemon
.Pq IFCONFIGD
daemon which manages wired and wireless networks.
.Pp
.Nm
is usually started at boot time, and can be enabled by
setting the following in
.Pa /etc/rc.conf.local :
.Pp
.Dl ifconfigd_flags=\&"\&"
.Pp
See
.Xr rc 8
and
.Xr rc.conf 8
for more information on the boot process
and enabling daemons.
.Pp
A running
.Nm
can be controlled with the
.Xr ifconfigctl 8
utility.
.Pp
The options are as follows:
.Bl -tag -width s
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log to
.Em stderr .
.It Fl f Ar file
Specify an alternative configuration file.
.It Fl n
Configtest mode.
Only check the configuration file for validity.
.It Fl s Ar socket
Use an alternate location for the default control socket.
.It Fl v
Produce more verbose output.
.El
.Sh FILES
.Bl -tag -width "/var/run/ifconfigd.sockXX" -compact
.It /etc/ifconfigd.conf
Default
.Nm
configuration file.
.It /var/run/ifconfigd.sock
.Ux Ns -domain
socket used for communication with
.Xr ifconfigctl 8 .
.El
.Sh SEE ALSO
.Xr ifconfigd.conf 5 ,
.Xr ifconfigctl 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox ?.? .
.Sh AUTHORS
.An -nosplit
The
.Nm
program was written by
.An Rafael Sadowski <rafael@sizeofvoid.org> 
